#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.sg: Reading...
data.terraform_remote_state.sg: Read complete after 1s
data.terraform_remote_state.vpc: Read complete after 1s
module.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["blue"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["blue"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["blue"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["blue"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["blue"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["blue"].data.aws_caller_identity.current: Read complete after 0s [id=178112661675]
module.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Read complete after 0s [id=178112661675]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "EKS Secret Encryption Key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                           = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/ex-eks/cluster"
      + retention_in_days = 90
      + tags              = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Example"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Example"
      + resource_id = (known after apply)
      + value       = "ex-eks"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["GithubOrg"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubOrg"
      + resource_id = (known after apply)
      + value       = "terraform-aws-modules"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["GithubRepo"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubRepo"
      + resource_id = (known after apply)
      + value       = "terraform-aws-eks"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "coredns"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "ex-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name    = "kube-proxy"
      + addon_version = (known after apply)
      + arn           = (known after apply)
      + cluster_name  = "ex-eks"
      + created_at    = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + tags          = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all      = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "vpc-cni"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "ex-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "ex-eks"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                  = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + version                   = (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-0066ecf88a9371306",
              + "subnet-06d0a57e6bcefec05",
              + "subnet-0ba6dcf6c10a51fb9",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-eks-eks-irsa"
        }
      + tags_all        = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-eks-eks-irsa"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ex-eks-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all    = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-eks-cluster-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "ex-eks-cluster"
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-eks-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-eks-cluster"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-eks-cluster"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + vpc_id                 = "vpc-08899f587b094b7f8"
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-eks-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"                      = "ex-eks"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-eks-node"
          + "kubernetes.io/cluster/ex-eks" = "owned"
        }
      + tags_all               = {
          + "DeployedBy"                   = "Terraformm"
          + "Description"                  = "For Geberal Purposes"
          + "Environment"                  = "Development"
          + "Example"                      = "ex-eks"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-eks-node"
          + "OwnerEmail"                   = "devops@example.com"
          + "Team"                         = "DevOps"
          + "Termination date"             = "Permanent"
          + "Type"                         = "EKS K8S Cluster"
          + "kubernetes.io/cluster/ex-eks" = "owned"
        }
      + vpc_id                 = "vpc-08899f587b094b7f8"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "To node 1025-65535"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Node all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node all ports/protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "ex-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
          + "t3.small",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "blue-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0066ecf88a9371306",
          + "subnet-06d0a57e6bcefec05",
          + "subnet-0ba6dcf6c10a51fb9",
        ]
      + tags                   = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "blue"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "blue"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "blue-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for blue EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "blue-"
      + tags                   = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Example"    = "ex-eks"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "blue"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Example"    = "ex-eks"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "blue"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Example"    = "ex-eks"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "blue"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "EKS managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "blue-eks-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "blue-eks-node-group"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "blue-eks-node-group"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + vpc_id                 = "vpc-08899f587b094b7f8"
    }

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "ex-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "green-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0066ecf88a9371306",
          + "subnet-06d0a57e6bcefec05",
          + "subnet-0ba6dcf6c10a51fb9",
        ]
      + tags                   = {
          + "Example"    = "ex-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "green"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "green"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + taint {
          + effect = "NO_SCHEDULE"
          + key    = "dedicated"
          + value  = "gpuGroup"
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 50
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "green-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for green EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "green-"
      + tags                   = {
          + "Example"    = "ex-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Example"    = "ex-eks"
              + "ExtraTag"   = "example"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "green"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Example"    = "ex-eks"
              + "ExtraTag"   = "example"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "green"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Example"    = "ex-eks"
              + "ExtraTag"   = "example"
              + "GithubOrg"  = "terraform-aws-modules"
              + "GithubRepo" = "terraform-aws-eks"
              + "Name"       = "green"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "EKS managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "green-eks-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-eks"
          + "ExtraTag"   = "example"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "green-eks-node-group"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For Geberal Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-eks"
          + "ExtraTag"         = "example"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "green-eks-node-group"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "EKS K8S Cluster"
        }
      + vpc_id                 = "vpc-08899f587b094b7f8"
    }

Plan: 47 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_id = (known after apply)

Warning: Redundant ignore_changes element

  on .terraform/modules/eks/main.tf line 305, in resource "aws_eks_addon" "this":
 305: resource "aws_eks_addon" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute modified_at is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: d9345800bc05277fdb862ea4bbacf6b74f63e402

*Pusher: @vvvegero97, Action: `pull_request`, Working Directory: `eu-north-1/K8S/eks`, Workflow: `Terraform CI/CD`*